Courses/7140/Lectures/Design/design-101.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Design 101</title>
<!-- 2016-06-05 Sun 12:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering Lecture"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href="./design-101-slides.html">Slides</a>
</div>
<div id="content">
<h1 class="title">Software Design 101</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Design D satisfies Spec S, S |= D</a></li>
<li><a href="#sec-2">2. Correct By Design</a></li>
<li><a href="#sec-3">3. Design Hierarchy</a></li>
<li><a href="#sec-4">4. Domain Specific Languages</a></li>
<li><a href="#sec-5">5. Documenting a Design</a></li>
<li><a href="#sec-6">6. Reference</a></li>
</ul>
</div>
</div>
<p>
This is a "graduate level 101" of software design.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Design D satisfies Spec S, S |= D</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Def: D "satisfies" S, notationally S |= D.  Every property of specs
S can be observed in D.  Not necessarily vice versa.
</li>
<li>S is written in a spec language, SL
</li>
<li>D is written in a design language, DL
</li>
<li>SL and DL: Plenty in research literature, but not in wide use
</li>
<li>We will use: Discrete math and Logic.
</li>
</ol>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Satisfies v Models</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>We used this symobol \(\models\) before and called it "models".
</li>
<li>We can read the above as: S models D.
</li>
<li>Models suggests abstraction.
</li>
<li>Satisfies suggests adding concrete details.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Correct By Design</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Correct By Design; i.e., "Correct By Intention/Effort"
</li>
<li>How do we judge if a design is "correct"?
<ol class="org-ol">
<li>in the absence of specs?
</li>
<li>a judge/jury system?
</li>
</ol>
</li>
<li>A design D satifies/meets a spec S
<ol class="org-ol">
<li>This can be precisely stated
</li>
</ol>
</li>
<li>A spec S is consistent with a requirements document R
<ol class="org-ol">
<li>This will remain in the judge/jury system.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Design Hierarchy</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Design D satisfies Spec S, S |= D
</li>
<li>D2 <i>refines</i> D1 versus D2 is an <i>alternate</i> design cf. D1
<ol class="org-ol">
<li>refines:  provides more detail.
</li>
<li>refines:  gets closer to the implementation language.
</li>
<li>alternate: explores a different design idea.
</li>
<li>alternate: better in some spec axes, worse in others.
</li>
</ol>
</li>
<li>Design Levels  
<ol class="org-ol">
<li>In general, this is a tree with many leaves.
</li>
<li>Siblings are alternates.
</li>
<li>One path from the root to an implementation: S |= D1 |= D2 |
&#x2026; |= Dn |= I
</li>
</ol>
</li>
<li>Implementation, I: source code in a PL
</li>
<li>Can/Should we have levels in Specs?  Yes;  S |= S1 |= S2 &#x2026; |= Sk
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Domain Specific Languages</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://martinfowler.com/books/dsl.html">http://martinfowler.com/books/dsl.html</a> "DSLs are small languages,
focused on a particular aspect of a software system. You can't
build a whole program with a DSL, but you often use multiple DSLs
in a system mainly written in a general purpose language."
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Documenting a Design</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="./design-doc.html">./design-doc.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Reference</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Design_rationale">http://en.wikipedia.org/wiki/Design_rationale</a>.  Required Reading.
</li>
<li><a href="http://www.literateprogramming.com/">http://www.literateprogramming.com/</a> "Design Documentation"
Recommended Visits.
</li>

<li><a href="http://www.literateprogramming.com/knuthweb.pdf">http://www.literateprogramming.com/knuthweb.pdf</a> Computer Journal,
198x. Required Reading
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2016-06-01
</div>
</body>
</html>
